{"config": [{"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-34-5734ad8f5978>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_2", "function_type": "lambda", "output_shape": null, "arguments": {}, "trainable": true, "batch_input_shape": [null, 66, 200, 3]}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_11", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 24, "subsample": [2, 2], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_6", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_12", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 36, "subsample": [2, 2], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_9", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_7", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_13", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 48, "subsample": [2, 2], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_10", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_8", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_14", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 64, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_11", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_9", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "border_mode": "same", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_15", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 64, "subsample": [1, 1], "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_12", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "dim_ordering": "tf", "name": "maxpooling2d_10", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_6", "output_dim": 1164, "W_regularizer": null, "b_regularizer": null, "input_dim": 7040, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_7", "output_dim": 100, "W_regularizer": null, "b_regularizer": null, "input_dim": 1164, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_8", "output_dim": 50, "W_regularizer": null, "b_regularizer": null, "input_dim": 100, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_9", "output_dim": 10, "W_regularizer": null, "b_regularizer": null, "input_dim": 50, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "name": "dense_10", "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "input_dim": 10, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}