{"config": [{"config": {"input_dtype": "float32", "activity_regularizer": null, "name": "convolution2d_1", "batch_input_shape": [null, 66, 200, 3], "W_regularizer": null, "b_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 24, "subsample": [2, 2], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 36, "subsample": [2, 2], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 48, "subsample": [2, 2], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 64, "subsample": [1, 1], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "border_mode": "valid", "W_regularizer": null, "b_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "nb_col": 3, "nb_row": 3, "dim_ordering": "tf", "trainable": true, "bias": true, "nb_filter": 64, "subsample": [1, 1], "activation": "relu"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "name": "dense_1", "output_dim": 250, "W_regularizer": null, "b_regularizer": null, "input_dim": 1152, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "relu", "bias": true, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_2", "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "input_dim": 250, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.2"}